questions = [
        [["Выберите номер теста", "keys", "8"]
         ],
        [["Императором Александром I вместо коллегий были утверждены:", "keys", "приказы", "!министерства", "комиссариаты", "наркоматы"],
        ["Д. Давыдов, А. Сеславин были героями:","keys","Русско-Турецкой войны 1811 года", "!Отечественной войны 1812 года", "Аустерлицкого сражения", "Восстания на Сенатской площади"],
        ["Заграничные походы русской армии с целью окончательного разгрома Наполеона начались в:","keys","1812 г.", "!1813 г.", "1814 г.", "1815 г."],
        ["Автором проекта реформ государственного управления в первое десятилетие царствования Александра I был:","keys","Г. Потёмкин", "С. Витте", "А. Аракчеев", "!М. Сперанский"],
        ["В знаменитом заседании военного совета в Филях принимали участие:","keys","!М.И. Кутузов, А.П. Ермолов", "П.С. Нахимов, В.А. Корнилов", "А.В. Суворов, П.А. Румянцев", "М.Д. Гурко, М.Д. Скобелев"],
        ["Героями–партизанами Отечественной войны 1812 года были","keys","!В. Кожина, Г. Курин", "Н. Раевский, П. Багратион", "А. Ермолов, М. Кутузов", "Барклай-де-Толли, М. Платов"],
        ["В районе этого населённого пункта русская армия, оторвав-шись от наступающих французов, разбила лагерь, пополнилачисленность и вооружение для продолжения войны 1812 г.:","keys","Фили", "Смоленск", "Аустерлиц", "Тарутино"],
        ["Авторами программных документов декабристов были:","keys","А. Герцен, Н. Чернышевский", "А. Желябов, П. Чаадаев", "П. Киреевский, П. Фигнер", "!П. Пестель, Н. Муравьёв"],
        ["С понятием «аракчеевщина» современники связывали:","keys","разработку проектов, ограничивающих власть царя", "ослабление цензурного гнёта, распространение иностранных книг", "возвращение из ссылки тех, кто попал в опалу при Павле I", "!создание военных поселений"],
        ["Объединение правителей ряда стран Европы, созданное посленаполеоновских войн с целью сохранения мира в Европе и под-держки старых монархических династий, называлось:","keys","Тройственный союз", "Северный союз", "!Священный союз", "Северный аккорд"],
        ["Россия в первой половине XIX века была:","keys","конституционной монархией", "демократической республикой", "!самодержавной монархией", "сословно–представительной монархией"],
        ["Одной из причин нападения Франции на Россию в 1812 г. было","keys","участие России в европейских военных союзах", "стремление России присоединиться к Тройственному союзу", "!несоблюдение Россией континентальной блокады Англии", "стремление России аннексировать часть Франции"],
        ["Политические убеждения декабристов сформировались подвлиянием:","keys","теории «официальной народности»", "теории «утопического социализма»", "неудачных преобразований Николая I", "!революционных событий в Европе"],
        ["Что было одной из причин поражения выступления декабри-стов на Сенатской площади?","keys","поддержка Николая I лейб-гвардии Московским полком", "неявка на Сенатскую площадь К. Рылеева", "!пассивная тактика декабристов", "совместные действия великих князей Михаила и Константина про-тив декабристов"],
        #["Какие из перечисленных ниже событий были связаны с име-нем А.А. Аракчеева?","keys","замена коллегий министерствами", "!учреждение военных поселений", "издание указа «о вольных хлебопашцах»", "открытие Царскосельского лицея", "!ужесточение цензурных запретов", "!ужесточение дисциплины в армии"],
        #["Какие из перечисленных преобразований свидетельствовалиоб «охранительных» тенденциях в годы царствования Александ-ра I (возможно более одного правильного ответа)?","keys","!учреждение военных поселений", "дарование Конституции Царству Польскому", "!сворачивание реформ М. Сперанского", "объявление амнистии пострадавших при Павле I", "!основание Царскосельского лицея"],
        #["Какие из перечисленных событий связаны с участием Россиив антифранцузских коалициях (возможно более одного правиль-ного ответа)?","keys","!битва при Лейпциге", "!сражение при Аустерлице", "!битва при Ватерлоо", "оборона Шипки", "образование Священного союза", "оборона Севастополя"],
        ["Какие из перечисленных ниже стран (кроме России) входили в Священный союз?","keys","!Германия", "Италия", "Франция", "Англия"],
        ["Негласный комитет при императоре Александре I – это","keys","совещательный орган, созданный для обсуждения и разработкиважнейших законопроектов", "!кружок молодых реформаторов при императоре в первые годы его правления", "совет под руководством М. Сперанского, готовивший министерскую реформу", "комитет для подготовки денежной реформы"],
        ["Министерства при Александре I – это органы","keys","законосовещательной власти при императоре", "законодательной власти", "!центральной исполнительной власти", "высшей судебной власти"],
        ["«Введение к уложению государственных законов» – это","keys","!проект государственного устройства на основе разделения властей", "проект российской конституции, разработанный при Павле I", "польской конституции", "свод законов Российской империи, принятый при Николае I"],
        #["Какие из перечисленных преобразований свидетельствовали об «реформаторских» тенденциях в годы царствования Александра I (возможно более одного правильного ответа)","keys","учреждение военных поселений", "!дарование Конституции Царству Польскому", "сворачивание реформ М. Сперанского", "!объявление амнистии пострадавших при Павле I", "!основание Царскосельского лицея", "ужесточение цензуры в последние годы царствования"],
        ["План реформ М.М. Сперанского затрагивал сферу","keys","внешней политики", "аграрный вопрос", "!государственное управление", "национальный вопрос"],
        ["Указ о вольных хлебопашцах Александра I","keys","полностью решил крестьянский вопрос", "вообще не касался крестьянского вопроса", "!в незначительной степени решил крестьянский вопрос", "такого указа вообще не существовало"],
        ["План реформы государственного управленияМ.М. Сперанского подразумевал:","keys","разделение властей на три ветви", "создание Государственной думы", "ограничение самодержавия", "!все три указанных положения"],
        ["После завершения наполеоновских войн император Алек-сандр I:","keys","дал Украине конституцию", "!дал Польше конституцию", "отобрал автономию у Польши", "отобрал автономию у Финляндии"],
        ["Последние годы правления Александра I","keys","являются высшей точкой его реформаторской деятельности", "являются периодом усиления либеральных тенденций в его политике", "!являются периодом усиления консервативных тенденций в его политике", "являются периодом войн и восстаний в России"],
        ["Император Александр I:","keys","отменил крепостное право в России", "отменил крепостное право на Украине", "ввёл крепостное право на Украине", "!отменил крепостное право в Прибалтике"],
        ["В первой половине XIX века в российской экономике","keys","появляются первые мануфактуры", "формируется всероссийский рынок", "преобладает тяжелая промышленность", "!происходит переход от мануфактуры к фабрике"],
        ["Участники Северного и Южного обществ впоследствии стали:","keys","!декабристами", "славянофилами", "западниками", "русскими социалистами"],
        ["Первая в России железная дорога была открыта в","keys","1861 г.", "1796 г.", "1812 г.", "!1837 г."],
        ["Общественное движение славянофилов выступало за:","keys","очищение русского языка от иностранных заимствований", "возвращение к допетровским порядкам", "объединение славянских народов под властью русского царя", "!за всё вышеперечисленное"],
        ["Характерная черта русского социализма – это:","keys","!его террористический характер", "его опора на крестьянскую общину", "его опора на рабочий класс", "его мирный характер"],
        ["А.И. Герцен был одним из родоначальников","keys","декабризма", "славянофильства", "западничества", "!русского социализма"],
        ["Император Николай I провел:","keys","!реформу положения государственных крестьян", "церковную реформу", "судебную реформу", "при нём вообще не было никаких реформ"],
        ["Среди лидеров декабристского движения были","keys","!Пестель и Рылеев", "Сперанский и Карамзин", "Герцен и Огарев", "Хомяков и Аксаков"],
        ["В 1853 г. Российская империя вступила в войну с:","keys","Наполеоном", "!Османской империей", "Китаем", "Персией"],
        ["«Континентальная блокада» была для России","keys","выгодна", "!невыгодна", "не имела никакого отношения к России", "имела место в XVIII в."],
        ["В битве под Аустерлицем победили:","keys","!французы", "русские", "австрийцы", "англичане"],
        ["Главнокомандующим русской армией в битве при Бородино был","keys","Суворов", "!Кутузов", "Румянцев", "Багратион"],
        ["Учреждение в России Государственного совета относится ковремени","keys","правления Екатерины II", "правления Павла I", "!правления Александра I", "правления Николая I"],
        ],

        #Тема 9
		[["Подпольная организация, развернувшая в 1870–1880 гг. террор против правительственных чиновников и царя, называлась:","keys","Северное общество", "Южное общество", "!Народная воля", "Черный передел"],
		["В каком году Россия добилась отмены ограничений Парижского мирного договора:","keys","в 1863 г", "в 1878 г.", "!в 1871 г", "в 1881 г"],
		["Отходниками во второй половине XIX в. называли:","keys","крестьян, переселившихся в другое село", "людей, по какой–либо причине выпавших из крестьянского сословия.", "!крестьян, ушедших на временные заработки в город", "горожан, нанимавшихся на сезонные работы в деревне"],
		["Кто из нижеперечисленных был признан основоположником русского национального театра:","keys","А.П. Чехов", "!А.Н. Островский", "Л.Н. Толстой", "И. А. Гончаров"],
		["Как назывались органы самоуправления, созданные в городах в соответствии с Городовым положением 1870 г:","keys","!думы и управы", "земские собрания", "земские управы", "магистраты"],
		["Что такое «отрезки» в контексте крестьянской реформы Александра 2:","keys","земля, которую отрезали у помещиков", "земля, которой наделялись крестьяне по реформе 1861 г", "!часть крестьянского надела, оказавшаяся «лишней» по сравнению с установленной в 1861 г. нормой", "земля, переходившая в государственный фонд"],
		["Что из нижеперечисленного относилось к сфере компетенций земских органов самоуправления:","keys","!вопросы сельского благоустройства и медицинского обеспечения", "законодательная деятельность", "передел крестьянской земли внутри общины", "судопроизводство"],
		["Что из нижеследующего было результатом судебной реформы 1864 г:","keys","!образован единый суд для представителей всех сословий", "помещики потеряли право суда над крестьянами", "ограничена состязательность судебного процесса", "присяжным заседателям передали функции адвокатов"],
		#["Какие из перечисленных событий относятся к Русско-турецкой войне 1877–1878 гг. (возможны два и более правильных ответа):","keys","!взятие Адрианополя русскими войсками", " штурм Севастополя ", " сражение на реке Альме ", "!взятие Шипкинского перевала", "!блокада Плевны","Синопское морское сражение"],
		["Что из нижеперечисленного произошло 19 февраля 1861 г:","keys","покушение на Александра II", "!подписание Манифеста об освобождении крестьян", "созыв Берлинского конгресса", "Синопское морское сражение"],
		#Ответ ниже М. А. Бакунин; Анархизм
		#["Прочтите отрывок из текста и укажите, о ком из деятелей общественного движения второй половины XIX в. идет речь и к какому направлению общественного движения относились его взгляды «Жизнь его, как и его идеи, полна парадоксов. Кто бы мог подумать, что этот отпрыск родовитой дворянской семьи, проведший детские и юношеские годы в тиши и идиллии помещичьей усадьбы среди многочисленных братьев и сестер, станет потом призывать крестьян к бунтам и поджогам, к уничтожению дворянских гнезд? Кто бы мог подумать, что этот скромный, богобоязненный юноша станет ярым ниспровергателем Бога и религии? Кто бы мог подумать, что он, склонный к углубленным философским размышлениям, поклонник Фихте и Гегеля, скоро решительно порвет с «философской заумью»:","free"],
		["Кто из нижеперечисленных общественно-политических деятелей XIX в. был автором «Записки об освобождении крестьян», известным российским либералом:","keys","!К.Д. Кавелин", "К.П. Победоносцев", "A.M. Горчаков", "М.А. Бакунин"],
		["Какое название получили выборные органы местного городского самоуправления, созданные в ходе реформ Александра II:","keys","губернские волости", "городские магистраты", "!земства", "городские думы"],
		["Что из нижеперечисленного характерно для взглядов участников народнической организации «Черный передел»:","keys","признание прогрессивности российского капитализма", "признание «теории малых дел»", "!приверженность пропагандистской деятельности", "приверженность тактике индивидуального террора"],
		["Укажите одну из причин, побудивших Александра II провести военную реформу:","keys","подготовка к началу Кавказской войны", "!поражение России в Крымской войне", "обострение противоречий между Антантой и Тройственным союзом", "неудачи русской армии на начальном этапе Русско-турецкой войны 1877–1878 гг"],
		["Что из названного относится ко второй половине XIX в:","keys","окончательное закрепощение крестьян", "!отмена крепостного права", "разрушение крестьянской общины", "введение подушной подати"],
		#["Какие из перечисленных ниже понятий относятся к крестьянской реформе 1861 г. (возможны два и более правильных ответа):","keys","!отрезки", "посессионные крестьяне", "подушная подать", "!временнообязанные крестьяне", "!выкупные платежи","," вольные хлебопашцы"],
		#ответ ниже Александр 2
		#["Прочтите отрывок из сочинения А.И. Герцена и определите имя исторического персонажа, о котором идет речь сделал много, очень много; его имя теперь уже стоит выше всех его предшественников. Он боролся во имя человеческих прав, во имя сострадания против хищной толпы закоснелых негодяев и сломил их. Этого ему ни народ русский, ни всемирная история не забудут. Из дали нашей ссылки мы приветствуем его именем, редко встречавшимся с самодержавием, не возбуждая горькой улыбки, — мы приветствуем его именем Освободителя :","free"],
		["Одной из особенностей промышленного развития России в пореформенные годы было:","keys","!широкое привлечение в экономику иностранного капитала", "низкие темпы развития", "невмешательство государства в экономику", "начало промышленного переворота"],
		#Ответ ниже Александр 2; Польском
		#["Прочтите отрывок из письма историка М.П. Погодина, определите имя императора, к которому оно было обращено, и о чьем праве на конституцию там идет речь «Свобода! Вот слово, которое должно раздаться на высоте самодержавного русского престола! Слово должно сопровождаться делом... Дайте _____________ конституцию, то есть позвольте им сочинять себе конституцию, которую они уже имели и которую верно будут сочинять несколько лет»:","free"],
		["Как называли после реформы 1861 г. крестьян, лично свободных, но выполнявших повинности в пользу помещика:","keys","барщинными", "посессионными", "приписными", "!временнообязанными"],
		["Кто из нижеуказанных лиц был активным деятелем общественного движения 1860–1880-х гг:","keys","Н.И. Новиков","!Н.Г. Чернышевский", " С.Ю. Витте", "С.С. Уваров"],
		["Как назывался участок земли, доставшийся крестьянам в результате реформы 1861:","keys","!наделом","поместьем", " отрубом", "имением"],
		#["Какие из перечисленных ниже явлений свидетельствовали о сохранении пережитков крепостничества в русской деревне в 1861–1881 гг. (возможны два и более правильных ответа):","keys","!выкупные платежи", "!барщина", "!отработки", "право крестьян переходить в другие сословия", " крестьянское предпринимательство", " право крестьян покупать землю"],
		["Императора Александра II к реформам подтолкнуло:","keys","восстание декабристов","война с Наполеоном", " завещание отца", "!поражение в Крымской войне"],
		["Крестьянская реформа Александра II касалась:","keys","церковных крестьян", "!помещичьих крестьян", " государственных крестьян", "крестьян Сибири и Дальнего Востока"],
		["Укажите понятия, относящиеся к крестьянской реформе Александра II:","keys","отруба и хутора", "коллективизация и индустриализация", "!выкупные платежи", "мелиорация"],
		["По реформе 1861 г. крестьяне получали свободу:","keys", "!бесплатно","за выкуп", "за выкуп в рассрочку на 49 лет", "в обмен на отработки"],
		["Император Александр II:","keys","!был убит народовольцами", "был убит польскими националистами", "умер своей смертью", "был убит во время дворцового переворота"],
		["Реформы Александра II:","keys","способствовали развитию феодальных отношений", "!способствовали развитию буржуазных отношений", "способствовали развитию социалистических отношений", "носили поверхностный характер"],
		["Александр II:","keys","создал Государственную Думу", "распустил Государственную Думу", "!создал городские думы", "отменил земские соборы"],
		["При Александре II суды стали:","keys","сословными", "классовыми", "!открытыми", "чрезвычайными"],
		["Промышленный переворот – это:","keys","насильственная смена власти в интересах крупной буржуазии", "!массовый переход от мануфактуры к фабрике", "подъем производительности труда после появления мануфактур", "перекачка средств из деревни в город"],
		["Внутренняя политика императора Александра III получила название:","keys","контрреволюция", "контрибуция", "!контрреформы", "коллективизация", " интервенция"],
		["Общественное движение в России в 60-70-ые годы XIX-го века:","keys","переживало упадок", "только зарождалось", "!переживало подъем", "было жестоко подавлено властями"],
		["Заговорщицкое, пропагандистское, бунтарское – это три разных направления:","keys","марксизма", "ленинизма", "либерализма", "!революционного народничества"],
		#Ответ ниже Российская социал-демократическая рабочая партия РСДРП
		#["В 1898 году марксистские кружки в России объединились в партию:","free"],
		["Народники – это:","keys","направление в литературе", "!направление в либеральном общественном движении", "направление в революционном общественном движении", "обычные крестьяне"],
		["«Земля и воля», «Черный передел», «Народная воля» – все это:","keys","названия газет", "названия политических партий", "названия марксистских кружков", "!названия народнических организаций"],
		["Российская экономика в 80-90-ые годы XIX века:","keys","находилась в состоянии кризиса", "находилась в состоянии застоя", "переживала послевоенное восстановление", "!находилась в состоянии подъема"],
		["В конце XIX века российская экономика развивалась по:","keys","убегающей модели", "спирали", "!догоняющей модели", "марксистской модели"],
		["Среди наиболее промышленно развитых районов Российской империи в конце XIX века были:","keys","Крым и Кубань", "Поволжье", "!Донбасс и Баку", "Тобольск и Омск"],
		["Что получили крепостные крестьяне в 1861:","keys","свободу от налогов", "право выхода из общины", "!личную свободу", "освобождение от службы в армии"]],

        [],

        []
    ]

# Структура ввода ответа
# ["ключ", 'тип_вопроса', 'ответ1', 'ответ2', 'ответ3', 'ответ4']
# типы: keys, free(ответ не имеет значения)
# ["ключ", 'keys', 'ответ1', 'ответ2', 'ответ3', 'ответ4']
# ["ключ", 'free']

# Блок -> Приветственные вопросы (блок 0) -> Вопросы уровня 1 (Data Science, блок 1) -> Вопросы уровня 2 (Data Science) (блок 2)
# Блок -> Приветственные вопрсы (блок 0) -> Вопросы уровня 1 (FrontEnd) (блок 3) -> Вопросы уровня 2 (FrontEnd) (блок 4)
